Revit 2027 API
PipeFittingAndAccessoryPressureDropUIData.GetUIDataItems Method
 Gets all UI data items stored in the UI data.
Namespace: Autodesk.Revit.UI.Plumbing
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<PipeFittingAndAccessoryPressureDropUIDataItem> GetUIDataItems()
Public Function GetUIDataItems As IList(Of PipeFittingAndAccessoryPressureDropUIDataItem)
public:
IList<PipeFittingAndAccessoryPressureDropUIDataItem^>^ GetUIDataItems()
member GetUIDataItems : unit -> IList<PipeFittingAndAccessoryPressureDropUIDataItem>
Return Value
IList<PipeFittingAndAccessoryPressureDropUIDataItem>
 An array of UI data items.
See Also
Reference
PipeFittingAndAccessoryPressureDropUIData Class
Autodesk.Revit.UI.Plumbing Namespace